Results/ReplicaCountAndLatency/ldbc/GRACE/5.txt
/usr/bin/java  -classpath /home/ayush/work/GRACEBenchmarks/YCSB/conf:/home/ayush/work/GRACEBenchmarks/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/grace-binding-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/HdrHistogram-2.1.12.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/antlr4-runtime-4.9.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/arangodb-java-driver-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/bson-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/bson-record-codec-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/caffeine-2.3.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-beanutils-1.9.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-collections-3.2.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-configuration2-2.8.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-lang3-3.12.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-logging-1.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/commons-text-1.10.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/core-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/error_prone_annotations-2.11.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/exp4j-0.4.8.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/failureaccess-1.0.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-core-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-driver-3.7.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-groovy-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-language-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-shaded-3.6.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/gremlin-util-3.7.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-cli-picocli-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-console-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-groovysh-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-json-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-jsr223-2.5.15-indy.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-swing-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-templates-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/groovy-xml-2.5.15.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/guava-31.1-jre.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/hppc-0.7.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/http-protocol-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/ivy-2.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/j2objc-annotations-1.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-annotations-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-core-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-databind-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-datatype-jakarta-jsonp-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jackson-serde-json-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jakarta.json-api-2.1.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/janusgraph-driver-1.0.0-rc2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/javatuples-1.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jbcrypt-0.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jcabi-log-0.20.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jcabi-manifests-1.2.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jcl-over-slf4j-1.7.25.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jline-2.14.6.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jsr305-3.0.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/jts-core-1.17.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/mongodb-driver-core-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/mongodb-driver-sync-5.5.1.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/neo4j-java-driver-4.4.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-all-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-buffer-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-dns-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-haproxy-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-http-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-http2-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-memcache-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-mqtt-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-redis-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-smtp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-socks-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-stomp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-codec-xml-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-common-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-handler-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-handler-proxy-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-handler-ssl-ocsp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-classes-macos-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-resolver-dns-native-macos-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-classes-epoll-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-classes-kqueue-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-aarch_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-epoll-4.1.86.Final-linux-x86_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-aarch_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-kqueue-4.1.86.Final-osx-x86_64.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-native-unix-common-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-rxtx-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-sctp-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/netty-transport-udt-4.1.86.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/noggit-0.8.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/picocli-4.3.2.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/reactive-streams-1.0.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/slf4j-api-1.7.25.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/snakeyaml-1.32.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/spatial4j-0.8.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-auth-common-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-core-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-uri-template-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-web-client-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/grace/target/dependency/vertx-web-common-4.5.7.jar site.ycsb.Client -t -db site.ycsb.db.GraceClient -P workloads/workload_grace -p HOSTURI=http://localhost:3000 -p DBTYPE=memgraph -p DBURI=bolt://localhost:7687 -p maxexecutiontime=120 -p threadcount=1 -p loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_vertices.json -p loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_edges.json -p vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_vertices.json -p edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_edges.json
Loaded 147023 vertices and 387329 edges
Initializing db: site.ycsb.db.GraceClient
GraceClient  Created
Using Database: site.ycsb.DBWrapper
Starting GRACE client
{deleteproportion=1, loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_edges.json, recordcount=10000, operationcount=20000000, loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_load_vertices.json, edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_edges.json, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, updateproportion=1, DBTYPE=memgraph, dotransactions=true, HOSTURI=http://localhost:3000, createproportion=1, DBURI=bolt://localhost:7687, maxexecutiontime=120, vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/ldbc_update_vertices.json, readallfields=true, db=site.ycsb.db.GraceClient, requestdistribution=latest}
GRACE HOSTURI: http://localhost:3000
DBTYPE: memgraph
DBURI: bolt://localhost:7687
[OVERALL], RunTime(ms), 120007
[OVERALL], Throughput(ops/sec), 330.3057321656237
[TOTAL_GCS_G1_Young_Generation], Count, 9
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 324
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2699842509186964
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 324
[TOTAL_GC_TIME_%], Time(%), 0.2699842509186964
[REMOVE_VERTEX], Operations, 2702
[REMOVE_VERTEX], AverageLatency(us), 4243.151369356033
[REMOVE_VERTEX], MinLatency(us), 2146
[REMOVE_VERTEX], MaxLatency(us), 29039
[REMOVE_VERTEX], 50thPercentileLatency(us), 4049
[REMOVE_VERTEX], 95thPercentileLatency(us), 5231
[REMOVE_VERTEX], 99thPercentileLatency(us), 10807
[REMOVE_VERTEX], Return=OK, 2702
[GET_EDGE_WITH_PROPERTY], Operations, 2732
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 1184.3246705710103
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 409
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 21375
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 1147
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 1585
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 2565
[GET_EDGE_WITH_PROPERTY], Return=OK, 2732
[ADD_EDGE], Operations, 2857
[ADD_EDGE], AverageLatency(us), 4652.901645082254
[ADD_EDGE], MinLatency(us), 2394
[ADD_EDGE], MaxLatency(us), 48063
[ADD_EDGE], 50thPercentileLatency(us), 4399
[ADD_EDGE], 95thPercentileLatency(us), 5795
[ADD_EDGE], 99thPercentileLatency(us), 11495
[ADD_EDGE], Return=OK, 2857
[ADD_VERTEX], Operations, 2881
[ADD_VERTEX], AverageLatency(us), 4707.119055883374
[ADD_VERTEX], MinLatency(us), 2414
[ADD_VERTEX], MaxLatency(us), 96191
[ADD_VERTEX], 50thPercentileLatency(us), 4451
[ADD_VERTEX], 95thPercentileLatency(us), 5971
[ADD_VERTEX], 99thPercentileLatency(us), 11359
[ADD_VERTEX], Return=OK, 2881
[GET_VERTEX_WITH_PROPERTY], Operations, 2809
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 1157.5485938056247
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 407
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 6887
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 1127
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 1523
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 2715
[GET_VERTEX_WITH_PROPERTY], Return=OK, 2809
[REMOVE_EDGE_PROPERTY], Operations, 2838
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 4265.3481324876675
[REMOVE_EDGE_PROPERTY], MinLatency(us), 2162
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 174207
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 4051
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 5267
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 10591
[REMOVE_EDGE_PROPERTY], Return=OK, 2838
[REMOVE_EDGE], Operations, 2844
[REMOVE_EDGE], AverageLatency(us), 4070.7668776371306
[REMOVE_EDGE], MinLatency(us), 2188
[REMOVE_EDGE], MaxLatency(us), 25071
[REMOVE_EDGE], 50thPercentileLatency(us), 3923
[REMOVE_EDGE], 95thPercentileLatency(us), 5043
[REMOVE_EDGE], 99thPercentileLatency(us), 9519
[REMOVE_EDGE], Return=OK, 2844
[GET_EDGE_LABELS], Operations, 2822
[GET_EDGE_LABELS], AverageLatency(us), 1180.1293408929837
[GET_EDGE_LABELS], MinLatency(us), 400
[GET_EDGE_LABELS], MaxLatency(us), 13919
[GET_EDGE_LABELS], 50thPercentileLatency(us), 1129
[GET_EDGE_LABELS], 95thPercentileLatency(us), 1575
[GET_EDGE_LABELS], 99thPercentileLatency(us), 2957
[GET_EDGE_LABELS], Return=OK, 2822
[GET_VERTEX_COUNT], Operations, 2774
[GET_VERTEX_COUNT], AverageLatency(us), 1134.4217736121125
[GET_VERTEX_COUNT], MinLatency(us), 447
[GET_VERTEX_COUNT], MaxLatency(us), 29743
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 1088
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 1491
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 2839
[GET_VERTEX_COUNT], Return=OK, 2774
[REMOVE_VERTEX_PROPERTY], Operations, 2825
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 4179.717168141593
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 2128
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 34335
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 4001
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 5195
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 9487
[REMOVE_VERTEX_PROPERTY], Return=OK, 2825
[GET_EDGES_WITH_LABEL], Operations, 2816
[GET_EDGES_WITH_LABEL], AverageLatency(us), 1499.612215909091
[GET_EDGES_WITH_LABEL], MinLatency(us), 413
[GET_EDGES_WITH_LABEL], MaxLatency(us), 45535
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 1305
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 2497
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 3623
[GET_EDGES_WITH_LABEL], Return=OK, 2816
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3.0
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 3
[CLEANUP], 50thPercentileLatency(us), 3
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 3
[SET_EDGE_PROPERTY], Operations, 2841
[SET_EDGE_PROPERTY], AverageLatency(us), 4229.586413234776
[SET_EDGE_PROPERTY], MinLatency(us), 2270
[SET_EDGE_PROPERTY], MaxLatency(us), 39519
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 4053
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 5291
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 10143
[SET_EDGE_PROPERTY], Return=OK, 2841
[SET_VERTEX_PROPERTY], Operations, 2847
[SET_VERTEX_PROPERTY], AverageLatency(us), 4226.991218826835
[SET_VERTEX_PROPERTY], MinLatency(us), 2298
[SET_VERTEX_PROPERTY], MaxLatency(us), 28735
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 4067
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 5191
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 9943
[SET_VERTEX_PROPERTY], Return=OK, 2847
[GET_EDGE_COUNT], Operations, 2916
[GET_EDGE_COUNT], AverageLatency(us), 1155.7973251028807
[GET_EDGE_COUNT], MinLatency(us), 361
[GET_EDGE_COUNT], MaxLatency(us), 14199
[GET_EDGE_COUNT], 50thPercentileLatency(us), 1126
[GET_EDGE_COUNT], 95thPercentileLatency(us), 1550
[GET_EDGE_COUNT], 99thPercentileLatency(us), 2593
[GET_EDGE_COUNT], Return=OK, 2916